In [1]:
import pandas as pd
import numpy as np
from datetime import datetime

In [2]:
# survey answer table (environment/job satisfaction, work-life balance)
employee_survey = pd.read_csv(r"C:\Users\lqt\Desktop\dataset sample\Kaggle HR Analytics Case Study\employee_survey_data.csv")
# check xem các survey có ai không trả lời không:
employee_survey['EmployeeID'].isna().value_counts()

False    4410
Name: EmployeeID, dtype: int64

In [3]:
employee_survey.head()

   EmployeeID  EnvironmentSatisfaction  JobSatisfaction  WorkLifeBalance
0           1                      3.0              4.0              2.0
1           2                      3.0              2.0              4.0
2           3                      2.0              2.0              1.0
3           4                      4.0              4.0              3.0
4           5                      4.0              1.0              3.0

In [4]:
employee_survey['EnvironmentSatisfaction'].isna().value_counts()

False    4385
True       25
Name: EnvironmentSatisfaction, dtype: int64

In [5]:
employee_survey['JobSatisfaction'].isna().value_counts()

False    4390
True       20
Name: JobSatisfaction, dtype: int64

In [6]:
employee_survey['WorkLifeBalance'].isna().value_counts()

False    4372
True       38
Name: WorkLifeBalance, dtype: int64

In [7]:
# general data table 
general_data = pd.read_csv(r"C:\Users\lqt\Desktop\dataset sample\Kaggle HR Analytics Case Study\general_data.csv")
general_data.info()
general_data_cleaned = general_data
general_data_cleaned.fillna(0.0)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4410 entries, 0 to 4409
Data columns (total 24 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Age                      4410 non-null   int64
 1   Attrition                4410 non-null   object
 2   BusinessTravel           4410 non-null   object
 3   Department               4410 non-null   object
 4   DistanceFromHome         4410 non-null   int64
 5   Education                4410 non-null   int64
 6   EducationField           4410 non-null   object
 7   EmployeeCount            4410 non-null   int64
 8   EmployeeID               4410 non-null   int64
 9   Gender                   4410 non-null   object
 10  JobLevel                 4410 non-null   int64
 11  JobRole                  4410 non-null   object
 12  MaritalStatus            4410 non-null   object
 13  MonthlyIncome            4410 non-null   int64
 14  NumCompaniesWorked       4391 non-null   float64
 15  Over18                   4410 non-null   object
 16  PercentSalaryHike        4410 non-null   int64
 17  StandardHours            4410 non-null   int64
 18  StockOptionLevel         4410 non-null   int64
 19  TotalWorkingYears        4401 non-null   float64
 20  TrainingTimesLastYear    4410 non-null   int64
 21  YearsAtCompany           4410 non-null   int64
 22  YearsSinceLastPromotion  4410 non-null   int64
 23  YearsWithCurrManager     4410 non-null   int64
dtypes: float64(2), int64(14), object(8)
memory usage: 827.0+ KB

C:\Users\lqt\AppData\Local\Temp\ipykernel_20732\3568737647.py:5: FutureWarning: In a future version of pandas all arguments of DataFrame.ffill will be keyword-only.
  general_data_cleaned.ffill(0.0)

,Age,Attrition,BusinessTravel,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeID,Gender,...,NumCompaniesWorked,Over18,PercentSalaryHike,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany,YearsSinceLastPromotion,YearsWithCurrManager
0,51,No,Travel_Rarely,Sales,6,2,Life Sciences,1,1,Female,...,1.0,Y,11,8,0,1.0,6,1,0,0
1,31,Yes,Travel_Frequently,Research & Development,10,1,Life Sciences,1,2,Female,...,0.0,Y,23,8,1,6.0,3,5,1,4
2,32,No,Travel_Frequently,Research & Development,17,4,Other,1,3,Male,...,1.0,Y,15,8,3,5.0,2,5,0,3
3,38,No,Non-Travel,Research & Development,2,5,Life Sciences,1,4,Male,...,3.0,Y,11,8,3,13.0,5,8,7,5
4,32,No,Travel_Rarely,Research & Development,10,1,Medical,1,5,Male,...,4.0,Y,12,8,2,9.0,2,6,0,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4405,42,No,Travel_Rarely,Research & Development,5,4,Medical,1,4406,Female,...,3.0,Y,17,8,1,10.0,5,3,0,2
4406,29,No,Travel_Rarely,Research & Development,2,4,Medical,1,4407,Male,...,2.0,Y,15,8,0,10.0,2,3,0,2
4407,25,No,Travel_Rarely,Research & Development,25,2,Life Sciences,1,4408,Male,...,0.0,Y,20,8,0,5.0,4,4,1,2
4408,42,No,Travel_Rarely,Sales,18,2,Medical,1,4409,Male,...,0.0,Y,14,8,1,10.0,2,9,7,8
4409,40,No,Travel_Rarely,Research & Development,28,3,Medical,1,4410,Male,...,0.0,Y,12,8,0,10.0,6,21,3,9

In [8]:
# overview: attrition rate, phòng ban nào có nhiều người nghỉ nhất, các survey response
general_data_cleaned['Attrition'].value_counts(normalize = True)

No     0.838776
Yes    0.161224
Name: Attrition, dtype: float64

In [9]:
general_data_cleaned['Department'].unique()

array(['Sales', 'Research & Development', 'Human Resources'], dtype=object)

In [10]:
general_data_cleaned['JobLevel'].unique()

array([1, 4, 3, 2, 5], dtype=int64)

In [11]:
general_data_cleaned['JobRole'].unique()

array(['Healthcare Representative', 'Research Scientist',
       'Sales Executive', 'Human Resources', 'Research Director',
       'Laboratory Technician', 'Manufacturing Director',
       'Sales Representative', 'Manager'], dtype=object)

In [12]:
manager_survey = pd.read_csv(r"C:\Users\lqt\Desktop\dataset sample\Kaggle HR Analytics Case Study\manager_survey_data.csv")
manager_survey.head()

   EmployeeID  JobInvolvement  PerformanceRating
0           1               3                  3
1           2               2                  4
2           3               3                  3
3           4               2                  3
4           5               3                  3

In [13]:
survey_data = pd.merge(employee_survey, manager_survey, how = 'outer', on = 'EmployeeID')

In [14]:
survey_data.isna().value_counts()

EmployeeID  EnvironmentSatisfaction  JobSatisfaction  WorkLifeBalance  JobInvolvement  PerformanceRating
False       False                    False            False            False           False                4327
                                                      True             False           False                  38
            True                     False            False            False           False                  25
            False                    True             False            False           False                  20
dtype: int64

In [15]:
general_data_cleaned_merged = pd.merge(general_data_cleaned, survey_data, how = 'inner', on = 'EmployeeID')

In [16]:
cleaned = general_data_cleaned_merged.dropna()

In [17]:
cleaned['Attrition'].value_counts(normalize=True)

No     0.838372
Yes    0.161628
Name: Attrition, dtype: float64

In [18]:
cleaned.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4300 entries, 0 to 4408
Data columns (total 29 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Age                      4300 non-null   int64
 1   Attrition                4300 non-null   object
 2   BusinessTravel           4300 non-null   object
 3   Department               4300 non-null   object
 4   DistanceFromHome         4300 non-null   int64
 5   Education                4300 non-null   int64
 6   EducationField           4300 non-null   object
 7   EmployeeCount            4300 non-null   int64
 8   EmployeeID               4300 non-null   int64
 9   Gender                   4300 non-null   object
 10  JobLevel                 4300 non-null   int64
 11  JobRole                  4300 non-null   object
 12  MaritalStatus            4300 non-null   object
 13  MonthlyIncome            4300 non-null   int64
 14  NumCompaniesWorked       4300 non-null   float64
 15  Over18                   4300 non-null   object
 16  PercentSalaryHike        4300 non-null   int64
 17  StandardHours            4300 non-null   int64
 18  StockOptionLevel         4300 non-null   int64
 19  TotalWorkingYears        4300 non-null   float64
 20  TrainingTimesLastYear    4300 non-null   int64
 21  YearsAtCompany           4300 non-null   int64
 22  YearsSinceLastPromotion  4300 non-null   int64
 23  YearsWithCurrManager     4300 non-null   int64
 24  EnvironmentSatisfaction  4300 non-null   float64
 25  JobSatisfaction          4300 non-null   float64
 26  WorkLifeBalance          4300 non-null   float64
 27  JobInvolvement           4300 non-null   int64
 28  PerformanceRating        4300 non-null   int64
dtypes: float64(5), int64(16), object(8)
memory usage: 1007.8+ KB

In [20]:
cleaned.to_csv(r"C:\Users\lqt\Desktop\cleaned.csv", index = False)

In [1]:
# import in_time table:

in_time = pd.read_csv(r"C:\Users\lqt\Desktop\dataset sample\Kaggle HR Analytics Case Study\in_time.csv")
in_time.info()
in_time_cleaned = in_time

# cleaning in_time_cleaned:

## replacing NaN values:

in_time_cleaned.fillna(0.0,inplace=True)

## setting up for melt:

in_time_col = list(in_time_cleaned.columns)
in_time_id_vars = in_time_col[0:1]
in_time_value_vars = in_time_col[1:]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4410 entries, 0 to 4409
Columns: 262 entries, EmployeeID to 31/12/2015
dtypes: float64(12), int64(1), object(249)
memory usage: 8.8+ MB

In [2]:
# melting in_time_cleaned:
in_time_melted = in_time_cleaned.melt(id_vars = in_time_id_vars, value_vars = in_time_value_vars, var_name= 'date', value_name = 'in_time')
in_time_melted = in_time_melted.sort_values(by = ['EmployeeID', 'date']).reset_index(drop = True)

In [3]:
# import out_time table:

out_time = pd.read_csv(r"C:\Users\lqt\Desktop\dataset sample\Kaggle HR Analytics Case Study\out_time.csv")
out_time.info()
out_time_cleaned = out_time

# cleaning out_time_cleaned:

## replacing NaN values:

out_time_cleaned.fillna(0.0,inplace=True)

## setting up for melt:

out_time_col = list(out_time_cleaned.columns)
out_time_id_vars = out_time_col[0:1]
out_time_value_vars = out_time_col[1:]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4410 entries, 0 to 4409
Columns: 262 entries, EmployeeID to 31/12/2015
dtypes: float64(12), int64(1), object(249)
memory usage: 8.8+ MB

In [ ]:
# melting out_time_cleaned:
out_time_melted = out_time_cleaned.melt(id_vars = out_time_id_vars, value_vars = out_time_value_vars, var_name= 'date', value_name = 'out_time')
out_time_melted = out_time_melted.sort_values(by = ['EmployeeID', 'date']).reset_index(drop = True)
out_time_melted

In [5]:
work_time = pd.merge(in_time_melted, out_time_melted, how = 'inner', on = ['EmployeeID', 'date'])

In [6]:
work_time.to_csv(r"C:\Users\lqt\Desktop\work_time.csv", index = False)